In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [6]:
obj = pd.Series([1,2,-3,4])
obj

0    1
1    2
2   -3
3    4
dtype: int64

In [7]:
obj.values

array([ 1,  2, -3,  4], dtype=int64)

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj = pd.Series([1.0,4,3,6],index=['j','a','c','k'])
obj

j    1.0
a    4.0
c    3.0
k    6.0
dtype: float64

In [11]:
obj['j']

1.0

In [12]:
obj[['c','a']]

c    3.0
a    4.0
dtype: float64

In [13]:
obj[obj>2]

a    4.0
c    3.0
k    6.0
dtype: float64

In [14]:
obj>2

j    False
a     True
c     True
k     True
dtype: bool

In [15]:
obj*2

j     2.0
a     8.0
c     6.0
k    12.0
dtype: float64

In [17]:
import numpy as np
np.exp(obj)

j      2.718282
a     54.598150
c     20.085537
k    403.428793
dtype: float64

In [18]:
'a' in obj

True

In [19]:
's' in obj

False

In [20]:
sdata = {'jack' : 20, 'lucy' : 4, 'allen' : 8, 'bob': 5}
obj3 = pd.Series(sdata)
obj3

jack     20
lucy      4
allen     8
bob       5
dtype: int64

In [21]:
status=['hhh','jack','bob','superman']
obj4=pd.Series(sdata,index=status)
obj4

hhh          NaN
jack        20.0
bob          5.0
superman     NaN
dtype: float64

In [23]:
pd.isnull(obj4)

hhh          True
jack        False
bob         False
superman     True
dtype: bool

In [24]:
pd.notnull(obj4)

hhh         False
jack         True
bob          True
superman    False
dtype: bool

In [26]:
obj4.isnull()

hhh          True
jack        False
bob         False
superman     True
dtype: bool

In [27]:
obj3+obj4

allen        NaN
bob         10.0
hhh          NaN
jack        40.0
lucy         NaN
superman     NaN
dtype: float64

In [28]:
obj4.name='population'
obj4

hhh          NaN
jack        20.0
bob          5.0
superman     NaN
Name: population, dtype: float64

In [30]:
obj4.index.name='people_name'
obj4

people_name
hhh          NaN
jack        20.0
bob          5.0
superman     NaN
Name: population, dtype: float64

In [32]:
obj4.index=['allen','lucy','jack','wang']
obj4

allen     NaN
lucy     20.0
jack      5.0
wang      NaN
Name: population, dtype: float64

In [39]:
data = {'state': ['Ohi','Ohi','Shanghai','Beighing','paris','sichuan'],'year':[2001,2000,3000,4000,6000,8200],'pop' : [1.0, 3.0, 4.0, 5.0,5.0,3.0]}
pd.DataFrame(data)

      state  year  pop
0       Ohi  2001  1.0
1       Ohi  2000  3.0
2  Shanghai  3000  4.0
3  Beighing  4000  5.0
4     paris  6000  5.0
5   sichuan  8200  3.0

In [38]:
pd.DataFrame(data).head()

      state  year  pop
0       Ohi  2001  1.0
1       Ohi  2000  3.0
2  Shanghai  3000  4.0
3  Beighing  4000  5.0
4     paris  6000  5.0

In [43]:
fram2= pd.DataFrame(data,columns=['pop','state','loss'],index=['one','two','three','four','five','six'])
fram2

       pop     state
one    1.0       Ohi
two    3.0       Ohi
three  4.0  Shanghai
four   5.0  Beighing
five   5.0     paris
six    3.0   sichuan

In [44]:
fram2.columns

Index(['pop', 'state'], dtype='object')

In [46]:
fram2['pop']

one      1.0
two      3.0
three    4.0
four     5.0
five     5.0
six      3.0
Name: pop, dtype: float64

In [50]:
fram2.state

one           Ohi
two           Ohi
three    Shanghai
four     Beighing
five        paris
six       sichuan
Name: state, dtype: object

In [55]:
fram2.loc['three']

pop             4
state    Shanghai
Name: three, dtype: object

In [56]:
fram3= pd.DataFrame(data,columns=['pop','state','loss'],index=['one','two','three','four','five','six'])
fram3

       pop     state loss
one    1.0       Ohi  NaN
two    3.0       Ohi  NaN
three  4.0  Shanghai  NaN
four   5.0  Beighing  NaN
five   5.0     paris  NaN
six    3.0   sichuan  NaN

In [58]:
fram3['loss'] = 10
fram3

       pop     state  loss
one    1.0       Ohi    10
two    3.0       Ohi    10
three  4.0  Shanghai    10
four   5.0  Beighing    10
five   5.0     paris    10
six    3.0   sichuan    10

In [63]:
fram3['loss'] = np.arange(6.0)
fram3

       pop     state  loss
one    1.0       Ohi   0.0
two    3.0       Ohi   1.0
three  4.0  Shanghai   2.0
four   5.0  Beighing   3.0
five   5.0     paris   4.0
six    3.0   sichuan   5.0

In [64]:
val = pd.Series([-1,2,4],index=['two','three','five'])
fram3['no']=val
fram3

       pop     state  loss   no
one    1.0       Ohi   0.0  NaN
two    3.0       Ohi   1.0 -1.0
three  4.0  Shanghai   2.0  2.0
four   5.0  Beighing   3.0  NaN
five   5.0     paris   4.0  4.0
six    3.0   sichuan   5.0  NaN

In [73]:
fram3['eastern']= fram3['pop']==3.0
fram3

       pop     state  loss   no  eastern
one    1.0       Ohi   0.0  NaN    False
two    3.0       Ohi   1.0 -1.0     True
three  4.0  Shanghai   2.0  2.0    False
four   5.0  Beighing   3.0  NaN    False
five   5.0     paris   4.0  4.0    False
six    3.0   sichuan   5.0  NaN     True

In [74]:
del fram3['pop']
fram3.columns

Index(['state', 'loss', 'no', 'eastern'], dtype='object')

In [83]:
pop = {'jack':{2005:2.4, 2004:1.0},'Lucy':{2003:1.5,2004:1.7,2006:1.6}}
fram4=pd.DataFrame(pop)
fram4

      jack  Lucy
2003   NaN   1.5
2004   1.0   1.7
2005   2.4   NaN
2006   NaN   1.6

In [84]:
fram4.T

      2003  2004  2005  2006
jack   NaN   1.0   2.4   NaN
Lucy   1.5   1.7   NaN   1.6

In [85]:
fram5= pd.DataFrame(pop,index=[2004,2006,2003])
fram5

      jack  Lucy
2004   1.0   1.7
2006   NaN   1.6
2003   NaN   1.5

In [90]:
fram4['jack'][:-2]

2003    NaN
2004    1.0
Name: jack, dtype: float64

In [91]:
pdata={'test1':fram4['jack'][:2], 'test2': fram4['Lucy'][:-1]}
pd.DataFrame(pdata)

      test1  test2
2003    NaN    1.5
2004    1.0    1.7
2005    NaN    NaN

In [92]:
fram4.index.name='year'
fram4.columns.name='state'
fram4

state  jack  Lucy
year
2003    NaN   1.5
2004    1.0   1.7
2005    2.4   NaN
2006    NaN   1.6

In [95]:
fram4.values

array([[nan, 1.5],
       [1. , 1.7],
       [2.4, nan],
       [nan, 1.6]])

In [99]:
dic={'a':4,"b":8,'c':9}
dic.keys()

dict_keys(['a', 'b', 'c'])

In [101]:
fram4.index=[2005,2006,2007,2008]
fram4

state  jack  Lucy
2005    NaN   1.5
2006    1.0   1.7
2007    2.4   NaN
2008    NaN   1.6

In [109]:
labels=pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [121]:
obj2=pd.Series([1.2,3,4],labels)
obj2

0    1.2
1    3.0
2    4.0
dtype: float64

In [122]:
obj2.index is labels

True

In [126]:
obj2[labels[0]]

1.2

In [128]:
fram4.index.name='year'
fram4

state  jack  Lucy
year
2005    NaN   1.5
2006    1.0   1.7
2007    2.4   NaN
2008    NaN   1.6

In [129]:
'jack' in fram4.columns

True

In [131]:
2009 in fram4.index

False

In [134]:
fram4.index=[2003,2008,2001,2002]
fram4

state  jack  Lucy
2003    NaN   1.5
2008    1.0   1.7
2001    2.4   NaN
2002    NaN   1.6

In [135]:
fram4=fram4.reindex([2001,2002,2003,2008])
fram4

state  jack  Lucy
2001    2.4   NaN
2002    NaN   1.6
2003    NaN   1.5
2008    1.0   1.7

In [138]:
obj3 = pd.Series(['bulu','purple','yellow'],index=[1,2,4])
obj3

1      bulu
2    purple
4    yellow
dtype: object

In [139]:
obj3.reindex(range(6),method='ffill')

0       NaN
1      bulu
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [142]:
fram = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['china','italy','lisbon'])
fram

   china  italy  lisbon
a      0      1       2
b      3      4       5
c      6      7       8

In [143]:
fram.reindex(['c','a','b'])

   china  italy  lisbon
c      6      7       8
a      0      1       2
b      3      4       5

In [149]:
states=["taiwan",'sichuan','chongqin']
fram.reindex(columns=states)
fram

   china  italy  lisbon
a      0      1       2
b      3      4       5
c      6      7       8

In [156]:
fram.loc[['c','a','b'],['china']]

   china
c      6
a      0
b      3

In [169]:
obj= pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj.drop('a',inplace=True)

In [170]:
obj

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [171]:
fram4

state  jack  Lucy
2001    2.4   NaN
2002    NaN   1.6
2003    NaN   1.5
2008    1.0   1.7

In [173]:
fram4.drop(['jack'],axis='columns')

state  Lucy
2001    NaN
2002    1.6
2003    1.5
2008    1.7

In [174]:
fram4

state  jack  Lucy
2001    2.4   NaN
2002    NaN   1.6
2003    NaN   1.5
2008    1.0   1.7

In [6]:
import numpy as np

In [8]:
import pandas as pd
data = pd.DataFrame(np.arange(16).reshape(4,4),index=['a','b','c','d'],columns=['one','two','theree','four'])
data

   one  two  theree  four
a    0    1       2     3
b    4    5       6     7
c    8    9      10    11
d   12   13      14    15

In [17]:
data['one']

a     0
b     4
c     8
d    12
Name: one, dtype: int32

In [19]:
data<5

     one    two  theree   four
a   True   True    True   True
b   True  False   False  False
c  False  False   False  False
d  False  False   False  False

In [21]:
data[data<5]=5
data

   one  two  theree  four
a    5    5       5     5
b    5    5       6     7
c    8    9      10    11
d   12   13      14    15

In [22]:
data.loc['a']

one       5
two       5
theree    5
four      5
Name: a, dtype: int32

In [24]:
data.loc[['a','b'],['one','two']]

   one  two
a    5    5
b    5    5

In [28]:
data.iloc[[0,1],[0,1]]

   one  two
a    5    5
b    5    5

In [29]:
data.iloc[2]

one        8
two        9
theree    10
four      11
Name: c, dtype: int32

In [30]:
data.loc[:'c','theree']

a     5
b     6
c    10
Name: theree, dtype: int32

In [32]:
data.theree>10

a    False
b    False
c    False
d     True
Name: theree, dtype: bool

In [34]:
df1=pd.DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [37]:
df2=pd.DataFrame(np.arange(20.).reshape(4,5),columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [40]:
df2.loc[1,'b']=np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [41]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [42]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0